-- phpMyAdmin SQL Dump
-- version 4.8.0.1
-- https://www.phpmyadmin.net/
--
-- 主機: 127.0.0.1
-- 產生時間： 2018-06-28 10:58:22
-- 伺服器版本: 10.1.32-MariaDB
-- PHP 版本： 7.2.5

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `dwp_final_project_4104056003`
--

--
-- 資料表的匯出資料 `comment`
--

INSERT INTO `comment` (`post_id`, `comment_floor`, `account_id`, `comment_content`, `post_time`) VALUES
(1, 1, 2, '沒畫過', '2018-06-26 21:15:15'),
(1, 2, 3, '天天發生', '2018-06-26 21:17:53'),
(2, 1, 2, '我也想買', '2018-06-26 21:15:02'),
(2, 2, 3, '想買+1', '2018-06-26 21:17:30'),
(2, 3, 4, '給我來一卡車', '2018-06-26 21:20:41'),
(2, 4, 5, '立馬下訂單', '2018-06-26 21:22:43'),
(2, 5, 5, '不買對不起自己', '2018-06-26 21:23:08'),
(2, 6, 6, '這也太讚', '2018-06-26 21:24:40'),
(2, 7, 6, '買了', '2018-06-26 21:24:57'),
(2, 8, 7, '推', '2018-06-26 21:31:54'),
(2, 9, 2, '蓋', '2018-06-26 21:39:35'),
(2, 10, 2, '蓋起來', '2018-06-26 21:39:40'),
(2, 11, 2, '豆頁痛', '2018-06-26 21:39:50'),
(2, 12, 2, 'ZZZ', '2018-06-26 21:40:09'),
(2, 13, 8, '123', '2018-06-27 07:47:01'),
(3, 1, 2, '扯', '2018-06-26 21:14:49'),
(3, 2, 3, '太浮誇了', '2018-06-26 21:17:21'),
(4, 1, 2, '根本中肯', '2018-06-26 21:14:41'),
(5, 1, 3, '貓咪!!!!!!!!!', '2018-06-26 21:16:49'),
(10, 1, 7, '這是你我的秘密', '2018-06-26 21:28:13'),
(11, 1, 7, '美翻', '2018-06-26 21:29:22'),
(12, 1, 1, '是我的頭貼欸', '2018-06-26 21:33:10'),
(12, 2, 1, '轉起來', '2018-06-26 21:33:23'),
(12, 3, 1, '全面旋轉', '2018-06-26 21:33:31');

--
-- 資料表的匯出資料 `followership`
--

INSERT INTO `followership` (`account_id_from`, `account_id_to`) VALUES
(1, 2),
(1, 4),
(1, 7),
(2, 1),
(3, 1),
(3, 2),
(4, 1),
(6, 1),
(7, 1),
(8, 1),
(8, 7);

--
-- 資料表的匯出資料 `likes`
--

INSERT INTO `likes` (`post_id`, `account_id`, `likes`) VALUES
(1, 1, b'1'),
(1, 5, b'0'),
(1, 6, b'0'),
(2, 2, b'1'),
(2, 4, b'1'),
(2, 5, b'1'),
(2, 6, b'1'),
(3, 2, b'0'),
(3, 4, b'0'),
(3, 5, b'0'),
(4, 2, b'1'),
(4, 4, b'1'),
(4, 5, b'1'),
(4, 6, b'1'),
(5, 2, b'1'),
(5, 3, b'1'),
(5, 4, b'1'),
(5, 5, b'1'),
(5, 6, b'1'),
(6, 2, b'0'),
(6, 3, b'0'),
(7, 2, b'1'),
(7, 3, b'0'),
(8, 1, b'1'),
(8, 2, b'1'),
(8, 3, b'1'),
(8, 7, b'1'),
(9, 1, b'1'),
(9, 2, b'1'),
(9, 4, b'1'),
(9, 7, b'1'),
(10, 2, b'0'),
(10, 3, b'0'),
(10, 4, b'0'),
(10, 5, b'0'),
(10, 6, b'0'),
(11, 2, b'1'),
(11, 4, b'1'),
(11, 5, b'1'),
(11, 7, b'1'),
(11, 8, b'1'),
(12, 1, b'1'),
(12, 2, b'1'),
(12, 4, b'1'),
(12, 5, b'1'),
(12, 7, b'1'),
(13, 2, b'1'),
(13, 4, b'1'),
(13, 5, b'1'),
(13, 6, b'1'),
(13, 7, b'1'),
(14, 2, b'0'),
(14, 4, b'0'),
(14, 5, b'0'),
(14, 6, b'0'),
(14, 7, b'1'),
(15, 2, b'1'),
(15, 3, b'1'),
(15, 4, b'1'),
(15, 5, b'1'),
(15, 6, b'1'),
(15, 7, b'1'),
(17, 8, b'1');
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
